// Задача 2: Задайте строку, содержащую латинские буквы
// в обоих регистрах. Сформируйте строку, в которой все
// заглавные буквы заменены на строчные.
//  Пример: “aBcD1ef!-” => “abcd1ef!-”


string text = "aBcD1ef!-";

Console.WriteLine(text.ToLower());
